<template>
  <div class="page">
    <h3>第六题</h3>
    <pre>
      http 和 https

    HTTPS和HTTP的区别主要如下：

       1、https协议需要到ca申请证书，一般免费证书较少，因而需要一定费用

       2、http是超文本传输协议，信息是明文传输，https则是具有安全性的ssl加密传输协议

       3、http和https使用的是完全不同的连接方式，用的端口也不一样，前者是80，后者是443

       4、http的连接很简单，是无状态的；HTTPS协议是由SSL+HTTP协议构建的可进行加密传输、身份认证的网络协议，比http协议安全

    HTTPS的优点

    尽管HTTPS并非绝对安全，掌握根证书的机构、掌握加密算法的组织同样可以进行中间人形式的攻击，但HTTPS仍是现行架构下最安全的解决方案，主要有以下几个好处：

      （1）使用HTTPS协议可认证用户和服务器，确保数据发送到正确的客户机和服务器

      （2）HTTPS协议是由SSL+HTTP协议构建的可进行加密传输、身份认证的网络协议，要比http协议安全，可防止数据在传输过程中不被窃取、改变，确保数据的完整性

      （3）HTTPS是现行架构下最安全的解决方案，虽然不是绝对安全，但它大幅增加了中间人攻击的成本

      （4）谷歌曾在2014年8月份调整搜索引擎算法，并称“比起同等HTTP网站，采用HTTPS加密的网站在搜索结果中的排名将会更高”
    </pre>
  </div>
</template>
